---
title: DocumentVersion
classe: Autodesk.Revit.DB.DocumentVersion
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# DocumentVersion

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsValidObject { get; }` | `documentVersion.IsValidObject` | Boolean |
| `Int32 NumberOfSaves { get; }` | `documentVersion.NumberOfSaves` | Int32 |
| `Guid VersionGUID { get; }` | `documentVersion.VersionGUID` | Guid |
| `Void Dispose()` | `documentVersion.Dispose()` | Void |
| `Boolean IsEqual(DocumentVersion)` | `documentVersion.IsEqual(other)` | Boolean |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```